In [1]:
import pandas as pd
import seaborn as sns

### Load dataset

In [2]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### EDA

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

As seen, columns age, embarked, deck, embark_town have missing data

#### Getting total number of missing values in each column

In [4]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

#### Imputing age with mean

In [5]:
df['age_mean'] = df['age'].fillna(df['age'].mean())

#### Imputing deck missing value with constant as it has major data missing

In [7]:
df['deck'] = df['deck'].astype(object)
df['deck_filled'] = df['deck'].fillna('Unknown')

#### creating missing flags

In [8]:
df['deck_missing_flag'] = df['deck'].isnull().astype(int)
df['age_missing_flag'] = df['age'].isnull().astype(int)

In [11]:
print(df[['age', 'age_mean', 'age_missing_flag']].head(10))

    age   age_mean  age_missing_flag
0  22.0  22.000000                 0
1  38.0  38.000000                 0
2  26.0  26.000000                 0
3  35.0  35.000000                 0
4  35.0  35.000000                 0
5   NaN  29.699118                 1
6  54.0  54.000000                 0
7   2.0   2.000000                 0
8  27.0  27.000000                 0
9  14.0  14.000000                 0

In [12]:
print(df[['deck', 'deck_filled', 'deck_missing_flag']].head(10))

  deck deck_filled  deck_missing_flag
0  NaN     Unknown                  1
1    C           C                  0
2  NaN     Unknown                  1
3    C           C                  0
4  NaN     Unknown                  1
5  NaN     Unknown                  1
6    E           E                  0
7  NaN     Unknown                  1
8  NaN     Unknown                  1
9  NaN     Unknown                  1